#### 1. Import pandas library

In [41]:
import pandas as pd

#### 2. Load data (users.csv, posts.csv)

In [42]:
users = pd.read_csv("users.csv")
posts = pd.read_csv("posts.csv")

In [52]:
users

       user_id  reputation  views  up_votes  down_votes
0       107658         305     91         2           0
1       218597        6559    374       361          25
2       326360        1802     97        40          14
3       379556        2335    261       125          10
4       450456        7746   3598       256          50
...        ...         ...    ...       ...         ...
14843   574332          41      6        10           0
14844  7155452          41      6         0           0
14845  5529001          41     11         0           0
14846  4105549          41     11         2           0
14847  4886640          41     11        13           0

[14848 rows x 5 columns]

In [53]:
posts

         post_id  score    user_id  view_count  comment_count
0       30336926      1        NaN          14              3
1       36873524      1        NaN          18              0
2       36605876      1        NaN          19              0
3       36718461      1        NaN          17              0
4       30434893      0        NaN          15              0
...          ...    ...        ...         ...            ...
325605  37142382      0  6315949.0          15              0
325606  36884286      0  3733872.0          20              1
325607  36140188      0  5216651.0          12              0
325608  36293699      1  4811040.0          20              1
325609  36028646      0  5910006.0          19              0

[325610 rows x 5 columns]

#### 3. Rename id column to user_id

In [45]:
users = users.rename(columns={'id': 'user_id'})

In [46]:
users.head(2)

,Unnamed: 0,user_id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,0,107658,ivordesign,NaN,NaN,2009-05-15 12:21:51.230000+00:00,2014-08-28 17:43:18.040000+00:00,United Kingdom,305,2,0,91,NaN,http://www.ivorthedesigner.co.uk
1,1,218597,icabod,NaN,NaN,2009-11-25 13:30:42.460000+00:00,2020-05-29 11:44:18.140000+00:00,United Kingdom,6559,361,25,374,NaN,http://icablog.org/

#### 4. Rename id column to post_id and owner_user_id to user_id

In [47]:
posts = posts.rename(columns={'id': 'post_id', 'owner_user_id': 'user_id' })

In [48]:
posts.head(2)

    post_id  user_id  score  view_count  comment_count  favorite_count
0  30336926      NaN      1          14              3             NaN
1  36873524      NaN      1          18              0             1.0

#### 5. Define new dataframes for users and posts with the following selected columns:
    **users columns**: user_id, reputation,views,up_votes,down_votes
    **posts columns**: post_id, score,user_id,view_count,comment_count

In [49]:
users = users[['user_id','reputation', 'views', 'up_votes', 'down_votes']]
users.head(2)

   user_id  reputation  views  up_votes  down_votes
0   107658         305     91         2           0
1   218597        6559    374       361          25

In [50]:
posts = posts[['post_id','score','user_id','view_count','comment_count']]

posts.head(2)

    post_id  score  user_id  view_count  comment_count
0  30336926      1      NaN          14              3
1  36873524      1      NaN          18              0

#### 6. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [55]:
merged_df = pd.merge(users,posts, on='user_id')
merged_df

#No acabo de entender como se mergean porque no tienen ningún field en común

,user_id,reputation,views,up_votes,down_votes,post_id,score,view_count,comment_count
0,450456,7746,3598,256,50,34989087,0,19,0
1,450456,7746,3598,256,50,4142174,0,15,0
2,1517244,4172,224,1362,32,37211628,2,18,0
3,1870509,897,105,86,2,30260248,1,11,4
4,101719,4055,332,174,16,34528617,0,18,0
...,...,...,...,...,...,...,...,...,...
1060,4295902,1,4,0,0,31038301,0,10,0
1061,2856201,11,21,0,0,19348144,0,19,2
1062,5882818,11,3,0,0,35199880,0,20,2
1063,6241297,13,2,0,0,36798683,0,12,0
1064,592420,21,30,2,0,36739521,0,5,0

#### 7. How many missing values do you have in your merged dataframe?

In [56]:
merged_df.isnull().sum()

user_id          0
reputation       0
views            0
up_votes         0
down_votes       0
post_id          0
score            0
view_count       0
comment_count    0
dtype: int64

There are no missing values

#### Bonus: Identify extreme values in your merged dataframe, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder. Hint: post_id cannot have outliers!